{
    "0":{
        "Symbol":"C",
        "Meaning":"The Pokémon can be caught in-game.",
        "Availability":1
    },
    "1":{
        "Symbol":"S",
        "Meaning":"The Pokémon can be caught in-game, but is only available at certain non-fixed times (e.g. Pokémon found through swarms or changing Pokémon in the Trophy Garden and Great Marsh). In Pokémon Colosseum and Pokémon XD, this instead means Pokémon can be snagged. In Pokémon Sun, Moon, Ultra Sun and Ultra Moon, this instead means Pokémon can be caught through the Island Scan.",
        "Availability":1
    },
    "2":{
        "Symbol":"D",
        "Meaning":"In Pokémon Diamond, Pearl, and Platinum, the Pokémon can be caught in-game via dual-slot mode. In Pokémon Sword and Shield, the Pokémon can be caught in-game via a Max Raid Battle at a Pokémon Den.",
        "Availability":1
    },
    "3":{
        "Symbol":"R",
        "Meaning":"The Pokémon can be received from someone (such as first partner Pokémon, revived Fossil, in-game trade or gift).",
        "Availability":1
    },
    "4":{
        "Symbol":"E",
        "Meaning":"The Pokémon cannot be caught in-game, but an earlier evolutionary stage can be obtained. It can be evolved into the Pokémon in this game. This may also be used as a suffix for other methods to indicate that the Pokémon must be evolved from a Pokémon caught using that method.",
        "Availability":1
    },
    "5":{
        "Symbol":"B",
        "Meaning":"The Pokémon cannot be caught in-game, but a later evolutionary stage can be obtained. It can be bred to produce the Pokémon in this game; this may also involve evolving the hatched Pokémon. This may also be used as a suffix for other methods to indicate that the Pokémon must be bred from a Pokémon caught using that method.",
        "Availability":1
    },
    "6":{
        "Symbol":"CD",
        "Meaning":"The Pokémon can be caught in-game, but is only accessible through paid DLC. \"D\" may also be used as a suffix for other methods to indicate that it can only be obtained through that method in paid DLC.",
        "Availability":1
    },
    "7":{
        "Symbol":"DA",
        "Meaning":"In Pokémon Sword and Shield's The Crown Tundra DLC, the Pokémon can be caught in-game via a Max Raid Battle during a Dynamax Adventure in the Max Lair.",
        "Availability":1
    },
    "8":{
        "Symbol":"CC",
        "Meaning":"The Pokémon is obtainable in-game but requires some form of communication with another core series game in order to obtain it. This may also be used as a prefix for other methods to indicate that the Pokémon requires a specific method after communicating with another game.",
        "Availability":1
    },
    "9":{
        "Symbol":"FS",
        "Meaning":"In Pokémon X and Y, the Pokémon can only be caught through the Friend Safari.",
        "Availability":1
    },
    "10":{
        "Symbol":"EV",
        "Meaning":"The Pokémon can be caught in-game, but only via event distribution (such as Poké Portal News) or using an item obtained exclusively via event distribution (such as the Eon Ticket).",
        "Availability":1
    },
    "12":{
        "Symbol":"PW",
        "Meaning":"The Pokémon is available via the Pokéwalker and can be transferred to Pokémon HeartGold and SoulSilver.",
        "Availability":0
    },
    "13":{
        "Symbol":"DR",
        "Meaning":"The Pokémon is available via Dream Radar and can be transferred to Pokémon Black 2 and White 2.",
        "Availability":0
    },
    "14":{
        "Symbol":"DW",
        "Meaning":"The Pokémon was available via Dream World and could be transferred to Pokémon Black, White, Black 2 and White 2 before it was shut down.",
        "Availability":0
    },
    "15":{
        "Symbol":"ET",
        "Meaning":"The Pokémon cannot be caught in-game, but an earlier evolutionary stage can be obtained. It can be evolved into the Pokémon in this game by trading. \"T\" may also be used as a suffix for other methods to indicate that the Pokémon must be evolved through trading from a Pokémon caught using that method.",
        "Availability":0
    },
    "16":{
        "Symbol":"Ev",
        "Meaning":"The Pokémon was available to this game at some point via distributions in real life such as ExtremeSpeed Pikachu. Additionally, all Global Link promotions and game-based Pokémon distributions fall under this category.",
        "Availability":0
    },
    "17":{
        "Symbol":"T",
        "Meaning":"This Pokémon can be obtained only by trading it from another game or transferring it from a game in a previous generation.",
        "Availability":0
    },
    "18":{
        "Symbol":"—",
        "Meaning":"This Pokémon is unobtainable in this game.",
        "Availability":0
    }
}